#tap "homebrew/core"
tap "homebrew/bundle"

if OS.mac?
    # taps
    #tap "homebrew/cask"
    tap "homebrew/cask-fonts"

    brew "noti"                     # Utility to display notifications from scripts
    brew "trash"                    # rm, but put in the trash rather than completely delete
    brew "coreutiles"               # GNU File, Shell, and Text utilities
    brew "docker"                   # Pack, ship and run any application as a lightweight container
    brew "docker-buildx"            # Docker CLI plugin for extended build capabilities with BuildKit
    brew "docker-compose"           # Isolated development environments using Docker
    brew "lima"                     # Linux virtual machines

    # CLI
    cask "google-cloud-sdk"         # Google Cloud SDK
    cask "session-manager-plugin"   # Plugin for AWS CLI to start and end sessions that connect to managed instances

    # Applications
    cask "hammerspoon"              # Powerful automation tool for OS X
    cask "kitty"                    # Better terminal emulator
    #cask "google-chrome"            # Google Chrome
    #cast "google-drive"             # Google Drive
    #cask "obsidian"                 # Knowledge base
    #cask "visual-studio-code"       # Open-source code editor
    #cask "zoom"                     # Video communication and virtual meeting platform

    # Fonts
    cask "font-cousine-nerd-font"
    cask "font-lilex-nerd-font"
elsif OS.linux?
    brew "xclip"                # Access to clipboard (similar to pbcopy/pbpaste)
end

# Packages
brew "asdf"             # Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "awk"              # Text processing scripting language
brew "awscli"           # Official Amazon AWS command-line interface
brew "bat"              # cat alternative
brew "cmake"            # Cross-platform make
brew "duf"              # df alternate
brew "dvc"              # Git for data science projects
brew "eza"              # Modern, maintained replacement for ls, build on exa
brew "fd"               # find alternative
brew "ffmpeg"           # Play, record, convert, and stream audio and video
brew "gh"               # GitHub CLI
brew "ghq"              # Remote repository management made easy
brew "git"              # Git version control (latest version)
brew "git-delta"        # Better git diff
brew "glow"             # Markdown viewer
brew "gnupg"            # GPG
brew "go"               # Open source programming language to build simple/reliable/efficient software
brew "grep"             # grep (latest)
brew "hexyl"            # od alternative
brew "htop"             # top alternative
brew "jq"               # Work with JSON files in shell scripts
brew "lua"              # Powerful, lightweight programming language
brew "luarocks"         # Package manager for the Lua programming language
brew "make"             # Utility for directing compilation
brew "ncdu"             # du alternate
brew "neofetch"         # Pretty system info
brew "neovim"           # vim alternative
brew "nodebrew"         # Node.js version manager
brew "procs"            # ps alternative
brew "python"           # python (latst)
brew "qpdf"             # Tools for and transforming and inspecting PDF files
brew "ripgrep"          # Very fast file searcher
brew "tmux"             # Terminal multiplexer
brew "tree"             # Pretty-print directory contents
brew "vim"              # vim (latest)
brew "wdiff"            # Word differences in text files
brew "wget"             # Internet file retriever
brew "zsh"              # zsh (latest)
