if OS.mac?
    # taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"

    brew "noti"                 # Utility to display notifications from scripts
    brew "trash"                # rm, but put in the trash rather than completely delete

    # Applications
    cask "imageoptim"           # Tool to optimize images
    cask "kitty"                # Better terminal emulator
    cask "obsidian"             # Knowledge base
    cask "visual-studio-code"   # Open-source code editor

    # Fonts
    cask "font-jetbrains-mono-nerd-font"
    cask "font-cousine-nerd-font"
elsif OS.linux?
    brew "xclip"                # Access to clipboard (similar to pbcopy/pbpaste)
end

tap "homebrew/bundle"
tap "homebrew/core"

# Packages
brew "awk"              # Text processing scripting language
brew "bat"              # cat alternative
brew "cmake"            # Cross-platform make
brew "deno"             # Secure runtime for JavaScript and TypeScript
brew "duf"              # df alternate
brew "exa"              # ls alternative
brew "fd"               # find alternative
brew "fzf"              # Fuzzy file searcher, used in scripts and in vim
brew "gh"               # GitHub CLI
brew "ghq"              # Remote repository management made easy
brew "git"              # Git version control (latest version)
brew "git-delta"        # Better git diff
brew "glow"             # Markdown viewer
brew "gnupg"            # GPG
brew "grep"             # grep (latest)
brew "hexyl"            # od alternative
brew "htop"             # top alternative
brew "jq"               # Work with JSON files in shell scripts
brew "lua"              # Powerful, lightweight programming language
brew "luarocks"         # Package manager for the Lua programming language
brew "navi"             # interactive cheatsheet tool for the command-line
brew "ncdu"             # du alternate
brew "neofetch"         # Pretty system info
brew "neovim"           # vim alternative
brew "node"             # Platform built on V8 to build network applications
brew "openjdk"          # Development kit for the Java programming language
brew "openjdk@11"       # Open JDK 11
brew "openjdk@8"        # Open JDK 8
brew "procs"            # ps alternative
brew "python"           # python (latst)
brew "ripgrep"          # Very fast file searcher
brew "sbt"              # Build tool for Scala projects
brew "scala"            # JVM-based programming language
brew "scala@2.13"       # Scala 2.13
brew "tmux"             # Terminal multiplexer
brew "tree"             # Pretty-print directory contents
brew "wdiff"            # Word differences in text files
brew "wget"             # Internet file retriever
brew "zsh"              # zsh (latest)
