if OS.mac?
    # taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"

    brew "noti"         # Utility to display notifications from scripts
    brew "trash"        # rm, but put in the trash rather than completely delete

    # Applications
    cask "kitty"                # a better terminal emulator
    cask "imageoptim"           # A tool to optimize images
    cask "visual-studio-code"   # Open-source code editor

    # Fonts
    cask "font-jetbrains-mono"
    cask "font-jetbrains-mono-nerd-font"
    cask "font-cousine"
    cask "font-cousine-nerd-font"
elsif OS.linux?
    brew "xclip"        # Access to clipboard (similar to pbcopy/pbpaste)
end

tap "homebrew/bundle"
tap "homebrew/core"

# Packages
brew "asdf"             # Extendable version manager
brew "bat"              # Better cat
brew "cloc"             # Lines of code counter
brew "cmake"            # Cross-platform make
brew "docker"           # Pack, ship and run any application as a lightweight container
brew "docker-buildx"    # Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-compose"   # Isolated development environments using Docker
brew "entr"             # File watcher / Command runner
brew "exa"              # ls alternative
brew "fd"               # find alternative
brew "fzf"              # Fuzzy file searcher, used in scripts and in vim
brew "gh"               # GitHub CLI
brew "git"              # Git version control (latest version)
brew "git-delta"        # A better git diff
brew "glow"             # Markdown viewer
brew "gnupg"            # GPG
brew "grep"             # grep (latest)
brew "highlight"        # Code syntax highlighting
brew "htop"             # A top alternative
brew "jq"               # Work with JSON files in shell scripts
brew "kind"             # Run local Kubernetes cluster in Docker
brew "kubernetes-cli"   # Kubernetes command-line interface
brew "lima"             # Linux virtual machines
brew "lua"              # Powerful, lightweight programming language
brew "luarocks"         # Package manager for the Lua programming language
brew "neofetch"         # Pretty system info
brew "neovim"           # A better vim
brew "node"             # Platform built on V8 to build network applications
brew "npm"              # Platform built on V8 to build network applications
brew "openjdk@11"       # Development kit for the Java programming language
brew "openjdk@17"       # Development kit for the Java programming language
brew "openjdk@8"        # Development kit for the Java programming language
brew "python"           # python (latst)
brew "ripgrep"          # Very fast file searcher
brew "sbt"              # Build tool for Scala projects
brew "scala@2.13"       # JVM-based programming language
brew "sheldon"          # Fast, configurable, shell plugin manager
brew "shellcheck"       # Diagnostics for shell sripts
brew "tmux"             # Terminal multiplexer
brew "tree"             # Pretty-print directory contents
brew "vim"              # vim (latest)
brew "wdiff"            # Word differences in text files
brew "wget"             # Internet file retriever
brew "z"                # Switch between most used directories
brew "zsh"              # zsh (latest)
